tests/load-test.yml
config:
  target: 'https://tedsai.vercel.app'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: "Ramp up"
  
scenarios:
  - name: "Homepage & Shop"
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/shop"
      - think: 3
      - get:
          url: "/observatoire"